---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetAllServices
source: html/ce53c061-fce3-80f7-ca41-80846e3b2159.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetAllServices Method

Returns all fabrication services in the fabrication configuration.

## Syntax (C#)
```csharp
public IList<FabricationService> GetAllServices()
```

## Returns
All fabrication services. The return will be empty if no services are found.